# Chapter 7.1 Handling Missing Data

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.227601       NaN       NaN
1  1.843811       NaN       NaN
2  0.615674       NaN  1.526078
3  0.589157       NaN -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [26]:
df.dropna()

          0         1         2
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [27]:
df.dropna(thresh = 2)

          0         1         2
2  0.615674       NaN  1.526078
3  0.589157       NaN -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

### Filling In Missing Data

In [28]:
df.fillna(0)

          0         1         2
0 -0.227601  0.000000  0.000000
1  1.843811  0.000000  0.000000
2  0.615674  0.000000  1.526078
3  0.589157  0.000000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.227601  0.500000  0.000000
1  1.843811  0.500000  0.000000
2  0.615674  0.500000  1.526078
3  0.589157  0.500000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [31]:
_ = df.fillna(0, inplace = True)

In [32]:
df

          0         1         2
0 -0.227601  0.000000  0.000000
1  1.843811  0.000000  0.000000
2  0.615674  0.000000  1.526078
3  0.589157  0.000000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA

In [35]:
df.iloc[4:, 2] = NA

In [36]:
df

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975       NaN -2.045878
3 -0.469139       NaN  0.213714
4  0.570787       NaN       NaN
5  1.641667       NaN       NaN

In [37]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975 -0.578002 -2.045878
3 -0.469139 -0.578002  0.213714
4  0.570787 -0.578002  0.213714
5  1.641667 -0.578002  0.213714

In [38]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975 -0.578002 -2.045878
3 -0.469139 -0.578002  0.213714
4  0.570787       NaN  0.213714
5  1.641667       NaN  0.213714

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

### Removing Duplicates

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [49]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})